src/cf/src/InformationRegisters/ТекущиеСостоянияЗадач/ТекущиеСостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеСостоянияЗадач</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>CatalogRef.СтатусыОбработкиЗадач</types>
    </type>
  </resources>
  <resources>
    <name>СрокСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЗадачиВРаботе/ЗадачиВРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиВРаботе</name>
  <resources>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипРаботы</name>
    <type>
      <types>EnumRef.ТипыРаботПоЗадачам</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ВидыСобытийЗадач/ВидыСобытийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийЗадач</name>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ИзмененаВажность</name>
  </enumValues>
  <enumValues>
    <name>ИзмененСрок</name>
  </enumValues>
  <enumValues>
    <name>ОткрытаКарточка</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоУведомление</name>
  </enumValues>
  <enumValues>
    <name>Перенаправлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКИсполнениюОтменено</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОтветИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПроцентЗавершения</name>
  </enumValues>
  <enumValues>
    <name>ДополнениеОписания</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКИсполнению</name>
  </enumValues>
  <enumValues>
    <name>ОценкаВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоЭлектроннойПочте</name>
  </enumValues>
  <enumValues>
    <name>ИзмененоСостояниеДругое</name>
  </enumValues>
  <enumValues>
    <name>ИзмененПолучательУслуг</name>
  </enumValues>
  <enumValues>
    <name>ИзмененВидЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированоПоТелеграм</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаБизнесТестировании</name>
      <description>На бизнес-тестировании</description>
    </items>
    <items>
      <name>НаУточнении</name>
      <description>На уточнении</description>
    </items>
    <items>
      <name>НоваяЗадача</name>
      <description>Новая задача</description>
    </items>
    <items>
      <name>ОжиданиеПереносаИзменений</name>
      <description>Ожидание переноса изменений в продуктив</description>
    </items>
    <items>
      <name>ОтмененоВыполнение</name>
      <description>Отменено выполнение</description>
    </items>
    <items>
      <name>Приостановлена</name>
      <description>Приостановлена</description>
    </items>
    <items>
      <name>Согласование</name>
      <description>Согласование</description>
    </items>
    <items>
      <name>ФормированиеТехническогоРешения</name>
      <description>Формирование тех. решения</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязателенСрокСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаПричинаИзмененияСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентВыполнения100</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПриРасчетеВремениВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФонаСостояния</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменятьТекстЦвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/InformationRegisters/ТекущиеСостоянияЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьТекущееСостояниеЗадачи(Задача,Состояние,СрокСостояния = '00010101',ПричинаСостояния = "",ПринудительноЗафиксироватьВИстории = Ложь, СтатусОбработки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ТекущиеСостоянияЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран()
		И Состояние = МенеджерЗаписи.Состояние Тогда
		
		Если СтатусОбработки = МенеджерЗаписи.СтатусОбработки
			Или СтатусОбработки = Неопределено Тогда
			// Выход в случае если старое состояние равно новому.
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МенеджерЗаписи.Задача = Задача;
	
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.СтатусОбработки = СтатусОбработки;
	МенеджерЗаписи.СрокСостояния = СрокСостояния;
	МенеджерЗаписи.ПричинаСостояния = ПричинаСостояния;
	МенеджерЗаписи.Установил = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ДатаУстановки = ТекущаяДата();
	
	МенеджерЗаписи.Записать(Истина);
	
	// Фиксация прочих изменений состояний в регистре истории.
	Если (Состояние <> Справочники.СостоянияЗадач.ВРаботе 
		И Состояние <> Справочники.СостоянияЗадач.Выполнена
		И Состояние <> Справочники.СостоянияЗадач.ОтмененоВыполнение)
		Или ПринудительноЗафиксироватьВИстории Тогда
	
		Комментарий = СтрШаблон(НСтр("ru = 'Изменение состояния: %1.'"),Состояние);
		Если ЗначениеЗаполнено(СрокСостояния) Тогда
			Комментарий = Комментарий + СтрШаблон(НСтр("ru = ' Установлен срок действия состояния до: %1.'"), СрокСостояния);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПричинаСостояния) Тогда
			Комментарий = Комментарий + СтрШаблон(НСтр("ru = ' Причина: %1'"),ПричинаСостояния);
		КонецЕсли;
		
		ИсторияСобытийЗадачВызовСервера.ЗаписатьСобытие(
			Задача, 
			Перечисления.ВидыСобытийЗадач.ИзмененоСостояниеДругое, 
			Комментарий);
		
	КонецЕсли;
	
	Если Состояние = Справочники.СостоянияЗадач.НаБизнесТестировании
		Или Состояние = Справочники.СостоянияЗадач.Выполнена
		Или Состояние = Справочники.СостоянияЗадач.ОтмененоВыполнение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадачиВРаботе.Исполнитель КАК Исполнитель
		|ИЗ
		|	РегистрСведений.ЗадачиВРаботе КАК ЗадачиВРаботе
		|ГДЕ
		|	ЗадачиВРаботе.Задача = &Задача";
		
		Запрос.УстановитьПараметр("Задача", Задача);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		ТекстСообщения = НСтр("ru = 'Автоматическая приостановка по состоянию задачи ""%1"".'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Состояние);
		
		Пока Выборка.Следующий() Цикл
			
			РегистрыСведений.ЗадачиВРаботе.ПриостановитьРаботуСЗадачей(Выборка.Исполнитель, Задача, ТекстСообщения);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеПоТекущемуСостояниюЗадачи(Задача) Экспорт
	
	РезультатТекущееСостояние = Новый Структура;
	РезультатТекущееСостояние.Вставить("Задача",Задача);
	РезультатТекущееСостояние.Вставить("Состояние",Справочники.СостоянияЗадач.Зарегистрирована);
	РезультатТекущееСостояние.Вставить("СтатусОбработки",Справочники.СтатусыОбработкиЗадач.ПустаяСсылка());
	РезультатТекущееСостояние.Вставить("СрокСостояния",'00010101');
	РезультатТекущееСостояние.Вставить("ПричинаСостояния","");
	РезультатТекущееСостояние.Вставить("Установил",Справочники.Пользователи.ПустаяСсылка());
	РезультатТекущееСостояние.Вставить("ДатаУстановки",'00010101');
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТекущиеСостоянияЗадач.Задача КАК Задача,
	|	ТекущиеСостоянияЗадач.Состояние КАК Состояние,
	|	ТекущиеСостоянияЗадач.СтатусОбработки КАК СтатусОбработки,
	|	ТекущиеСостоянияЗадач.СрокСостояния КАК СрокСостояния,
	|	ТекущиеСостоянияЗадач.ПричинаСостояния КАК ПричинаСостояния,
	|	ТекущиеСостоянияЗадач.Установил КАК Установил,
	|	ТекущиеСостоянияЗадач.ДатаУстановки КАК ДатаУстановки
	|ИЗ
	|	РегистрСведений.ТекущиеСостоянияЗадач КАК ТекущиеСостоянияЗадач
	|ГДЕ
	|	ТекущиеСостоянияЗадач.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		ЗаполнитьЗначенияСвойств(РезультатТекущееСостояние,Выборка);
	
	КонецЕсли;
	
	Возврат РезультатТекущееСостояние;

КонецФункции

#КонецОбласти

#КонецЕсли
